---
kind: type
id: T:Autodesk.Revit.DB.AssemblyDifferenceMemberDifference
source: html/8672fb73-9882-5078-9aa2-72bf84d63c7f.htm
---
# Autodesk.Revit.DB.AssemblyDifferenceMemberDifference

The two assemblies being compared have different members

## Syntax (C#)
```csharp
public class AssemblyDifferenceMemberDifference : AssemblyDifference
```

## Remarks
This difference means that there is a member of the first assembly which
 is different from the corresponding member of the second assembly.
 Details about the difference are in memberDifference.